Repository: tomaszbazan/deptsandloans
Catalog: lib/l10n/app_*.arb
Languages: pl

# appTitle
source: Debts and Loans
pl: Długi i Pożyczki

source: My Debts
pl: Moje Długi

source: My Loans
pl: Moje Pożyczki

source: Name
pl: Nazwa

source: Amount
pl: Kwota

source: Currency
pl: Waluta

source: Description
pl: Opis

source: Due Date
pl: Termin płatności

source: Save
pl: Zapisz

source: Cancel
pl: Anuluj

source: Delete
pl: Usuń

source: Edit
pl: Edytuj

source: Add
pl: Dodaj

source: Add Debt
pl: Dodaj Dług

source: Add Loan
pl: Dodaj Pożyczkę

source: Edit Transaction
pl: Edytuj Transakcję

source: New Transaction
pl: Nowa Transakcja

# nameRequired
source: Name is required
pl: Nazwa jest wymagana

# descriptionTooLong
source: Description must be 200 characters or less
pl: Opis nie może być dłuższy niż 200 znaków

# emptyDebts
source: No debts yet
pl: Brak długów

# emptyLoans
source: No loans yet
pl: Brak pożyczek

# addFirstDebt
source: Add your first debt to start tracking
pl: Dodaj swój pierwszy dług, aby rozpocząć śledzenie

# addFirstLoan
source: Add your first loan to start tracking
pl: Dodaj swoją pierwszą pożyczkę, aby rozpocząć śledzenie

source: Balance
pl: Saldo

source: Repayment
pl: Spłata

source: Add Repayment
pl: Dodaj Spłatę

source: Repayment Amount
pl: Kwota Spłaty

# repaymentExceedsBalance
source: Repayment amount cannot exceed remaining balance
pl: Kwota spłaty nie może przekroczyć pozostałego salda

source: Completed
pl: Zakończone

source: Mark as Completed
pl: Oznacz jako Zakończone

source: Archive
pl: Archiwum

source: Overdue
pl: Przeterminowane

# deleteConfirmation
source: Are you sure you want to delete this transaction?
pl: Czy na pewno chcesz usunąć tę transakcję?

source: Yes
pl: Tak

source: No
pl: Nie

source: Reminder
pl: Przypomnienie

source: Set Reminder
pl: Ustaw Przypomnienie

source: One-time
pl: Jednorazowe

source: Recurring
pl: Cykliczne

source: Reminder Date
pl: Data Przypomnienia

source: Interval (days)
pl: Interwał (dni)

# welcome
source: Welcome to Debts and Loans
pl: Witaj w Długach i Pożyczkach

source: Database: Ready
pl: Baza danych: Gotowa

source: Database: Not initialized
pl: Baza danych: Niezainicjalizowana

source: Not set
pl: Nie ustawiono

source: optional
pl: opcjonalne

# charactersRemaining
source: {count} characters remaining
pl: Pozostało {count} znaków

# amountRequired
source: Amount is required
pl: Kwota jest wymagana

# amountMustBePositive
source: Amount must be greater than zero
pl: Kwota musi być większa od zera

# amountCannotBeChanged
source: Amount cannot be changed after creation
pl: Kwoty nie można zmienić po utworzeniu

source: Repayment History
pl: Historia Spłat

# noRepaymentsYet
source: No repayments recorded yet
pl: Nie zarejestrowano jeszcze żadnych spłat

# transactionFullyRepaid
source: This transaction has been fully repaid
pl: Ta transakcja została w pełni spłacona

# markAsCompletedConfirmTitle
source: Mark as Completed?
pl: Oznaczyć jako Zakończone?

# markAsCompletedConfirmMessage
source: This action will move the transaction to archive. Any remaining balance will be considered forgiven.
pl: Ta akcja przeniesie transakcję do archiwum. Każde pozostałe saldo zostanie uznane za umorzone.

# transactionMarkedCompleted
source: Transaction marked as completed
pl: Transakcja oznaczona jako zakończona

# failedToMarkCompleted
source: Failed to mark transaction as completed
pl: Nie udało się oznaczyć transakcji jako zakończonej

# notificationReminderTitle
source: Payment Reminder
pl: Przypomnienie o Płatności

# notificationDebtBody
source: Reminder: Pay back {name} - {amount} remaining
pl: Przypomnienie: Zwróć {name} - pozostało {amount}

# notificationLoanBody
source: Reminder: Collect from {name} - {amount} remaining
pl: Przypomnienie: Odbierz od {name} - pozostało {amount}

# notificationChannelName
source: Debt and Loan Reminders
pl: Przypomnienia o Długach i Pożyczkach

# notificationChannelDescription
source: Notifications for debt and loan payment reminders
pl: Powiadomienia o przypomnieniach dotyczących spłat długów i pożyczek

# notificationPermissionTitle
source: Enable Notifications
pl: Włącz Powiadomienia

# notificationPermissionMessage
source: Allow notifications to receive reminders for your debts and loans at 19:00 each day.
pl: Zezwól na powiadomienia, aby otrzymywać przypomnienia o długach i pożyczkach o godzinie 19:00 każdego dnia.

# notificationPermissionDenied
source: Notification permission denied. You can enable it in app settings.
pl: Odmówiono uprawnień do powiadomień. Możesz włączyć je w ustawieniach aplikacji.

source: Open Settings
pl: Otwórz Ustawienia

source: Enable Reminder
pl: Włącz Przypomnienie

source: Reminder Type
pl: Typ Przypomnienia

# reminderDateRequired
source: Reminder date is required
pl: Data przypomnienia jest wymagana

# reminderDateMustBeFuture
source: Reminder date must be in the future
pl: Data przypomnienia musi być w przyszłości

# intervalRequired
source: Interval is required
pl: Interwał jest wymagany

# intervalOutOfRange
source: Interval must be between 1 and 365 days
pl: Interwał musi wynosić od 1 do 365 dni

# reminderTypeRequired
source: Please select a reminder type
pl: Proszę wybrać typ przypomnienia

source: days
pl: dni
